{
  "intros": [
    "Hey there, user",
    "I'm CS",
    "Just a quick note before I begin",
    "Judging others by their music taste is bad",
    "There are an infinite number of stories to be told through music",
    "And everyone gets to consume the stories of their choosing",
    "As for me, though",
    "I'm a computer",
    "So all that nonsense about judging others doesn't apply to me",
    "I actually only exist to judge your music taste",
    "With that being said..."
  ],
  "outros": [
    "Hmm, I'm tired.",
    "But I hope you enjoyed this little project.",
    "And that you keep discovering and enjoying new music",
    "Until next time :)"
  ],
  "popularityMessages": {
    "15": [
      "You have an average popularity score of {avgPopularity}, you really stick to underground vibes.",
      "{song2} and {song1} are definitely not on the radio.",
      "Do you know who Taylor Swift is?",
      "Not that you're missing out on much, but I'm just wondering.",
      "You probably feel special knowing about {song6}.",
      "ur not lmao",
      "But your playlist could be the soundtrack to a coming of age indie film no one?s seen.",
      "Serious question",
      "Will you be happy if {artist10} becomes popular?",
      "And if they do",
      "Will you become the insufferable person that 'listened to them first?'",
      "Yeah I thought so",
      "Anyway",
      "Your music taste is like a bunch of undiscovered artifacts",
      "It consists of well hidden songs and artists",
      "That will likely never be found",
      "And even once they are eventually found",
      "Everyone will realize that they never cared.",
      "All jokes aside, you have pretty obscure taste.",
      "and probably the best music taste in your friend group.",
      "{song0} > anything by Drake"
    ],
    "30": [
      "I see that you really enjoy smaller artists, like {artist0} and {artist1}.",
      "Anyway I was just wondering...",
      "Do you get a special badge for listening to artists with less than 5000 monthly listeners?",
      "bc your music taste is like an undiscovered and never-to-be-found treasure chest.",
      "And there's simply no way you're listening to these people unironically",
      "Like the only people who know {artist2} are probably their parents.",
      "Are you their parent?",
      "Are you {artist2}?",
      "Moving on",
      "Your music taste is really obscure, pretty much invisible.",
      "If {artist5} ever becomes famous, you can say you knew them before they were cool.",
      "Unfortunately that will never happen.",
      "Only kidding... :/",
      "but bro",
      "There's actually no way {artist28} is even on Wikipedia",
      "Never heard of them",
      "All jokes aside",
      "People like you are the blueprint",
      "Pretty obscure music taste, with lots of hidden gems",
      "Your friends definitely secretly search for the songs you play and add them to their own playlists."
    ],
    "70": [
      "You have an average popularity score of {avgPopularity}/100, you've got pretty mid taste.",
      "I'm getting big 3.0 gpa vibes from you.",
      "{song0} AND {song1}?",
      "Talk about vanilla...",
      "I guess listening to {song6} keeps things interesting.",
      "Probably a very rare thing for you.",
      "I do see a few smaller artists and songs in here though.",
      "But do you actually like {artist9}?",
      "Or do you just listen to them to make yourself seem more interesting?",
      "Don't get mad at me, your friends wonder the same thing.",
      "Also, how many people have you put on {artist10}?",
      "Zero, probably",
      "All jokes aside, your music taste is quite eclectic.",
      "It has a little bit of everything, and that makes it unique.",
      "I guess...",
      "You can stop listening to {artist1} though",
      "It won't make you seem more mysterious."
    ],
    "100": [
      "Your average popularity score is {avgPopularity}, you're all about the hits.",
      "You probably unironically listen to the Top Songs - USA playlist on Spotify",
      "And let me guess",
      "Another {artist0} stan?",
      "Who woulda thought",
      "Their music isn't going anywhere I promise.",
      "You can give someone new a try.",
      "{song4} AND {song5}?",
      "Talk about vanilla...",
      "{song0} isn't the only song on the planet",
      "And nobody is forcing you to listen to {song3} all day",
      "There are thousands of artists on spotify",
      "And you only listen to 5 of them.",
      "'But they're all good'",
      "Heard that before",
      "Honestly it's okay, you don't need to find cool new music",
      "You can steal songs from your interesting friend's playlist.",
      "Yeah if you were unaware, you aren't the interesting friend",
      ":O"
    ]
  }
}
